<template>
  <div class="guild-rules">
    <h1>Правила гильдии</h1>
    <p>
      Мы стараемся обеспечить комфортную игру всем людям, играющим в нашей гильдии. Мы требуем от
      игроков уважения по отношению к остальным членам нашего сообщества.
    </p>
    <p>
      Небольшой список наших правил:
      <ol>
        <li>
          Мы не допускаем поведение или выражения в любой форме, подразумевающие ненависть,
          предрассудки или нетерпимость, в том числе действия, поддерживающие или одобряющие
          дискриминацию,
          унижение, агрессию или насилие на основе следующих характеристик: раса, этническая
          принадлежность, национальное происхождение, религия, половой признак, сексуальная
          ориентация.
        </li>
        <li>
          Запрещены любые обсуждения политики и религии.
        </li>
        <li>
          Материалы, демонстрирующие жестокость и откровенно сексуальный контент запрещены.
        </li>
        <li>
          Запрещено исключение игрока из гильдейской группы/рейдовой группы без объяснения причин.
          Группа считается гильдейской, если её лидером является член гильдии.
        </li>
        <li>
          Запрещено неуважительные высказывания/обращения по отношению к членам гильдии.
        </li>
      </ol>
    </p>
    <p>
      Мы строго относимся к несоблюдению правил. Если кто-то нарушает их, Вы можете сообщить
      об этом главе гильдии или офицерам, будут приняты соответствующие меры по устранению
      вышеуказанных нарушений.
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({

});
</script>

<style scoped>
.guild-rules {
  max-width: var(--text-page-content-max-width);
  padding: 0 40px;
}

li {
  list-style: initial;
}

li:not(:last-child) {
  margin: 0 0 10px 0;
}
</style>
