<template>
  <div class="join-guild">
    <h1>Вступление в гильдию</h1>
    <p>
      Если вы ознакомились с нашими правилами и хотите вступить в нашу гильдию, то
      вы можете поступить следующим образом:
      <ul>
        <li>
          Подать заявку через внутриигровое окно гильдий. Для этого откройте окно
          "Гильдии и сообщества" (можно найти в нижнем правом углу экрана в стандартном интерфейсе),
          перейдите на вкладку "Поиск гильдии" и введите в поиск "Зверинец Владыки". После нажатия
          кнопки "Поиск" в списке появится наша гильдия, и Вы сможете подать заявку, нажав
          соответствующую кнопку на плашке гильдии. Как только глава гильдии или офицеры зайдут в
          игру, они сразу же рассмотрят Вашу заявку.
        </li>
        <li>
          Написать напрямую главе гильдии или офицерам внутри игры. Ник главы - Мурдра,
          ники офицеров - Йорданиэль и Мантагро.
        </li>
        <li>
          Зайти в Discord-канал гильдии (ссылка внизу страницы сайта) и написать в общем канале или
          в личные сообщения главе или одному из перечисленных офицеров (ники в Discord такие же).
        </li>
      </ul>
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'JoinGuild',
});
</script>

<style scoped>
.join-guild {
  max-width: var(--text-page-content-max-width);
  padding: 0 40px;
}

ul {
  margin: 20px 0 0 0;
  padding: revert;
}

li {
  list-style: initial;
}

li:not(:last-child) {
  margin: 0 0 10px 0;
}
</style>
