<template>
  <div class="guild-rules">
    <h1>Правила проведения рейдов</h1>
<!--    <p>-->
<!--      Здесь приводятся правила проведения -->
<!--    </p>-->
    <p>
      <ol>
        <li>
          Основное РТ проводится в субботу и воскресенье с 18:45 до 22:00 МСК. 15 минут даётся на то
          чтобы собраться с мыслями и подготовиться (купить фласки, еду, сменить билды. спеки и т.д)
          и почистить треш. В 19:00 начинается первый пул босса;
        </li>
        <li>
          События для основного РТ обычно создаются заранее в календаре. Если их нет, то это не
          значит,
          что рейд отменён. Об отмене рейда сообщается в дискорде гильдии в канале "объявления";
        </li>
        <li>
          Критерии допуска к рейду нередко меняются. Актуальные критерии всегда указываются во
          внутриигровых календарных событиях;
        </li>
        <li>
          Используется внутриигровая система лута;
        </li>
        <li>
          В случае, если игрок получил предмет в результате стандартного распределения добычи, но
          в итоге понял, что она ему не нужна, то игрок может передать предмет РЛу, чтобы РЛ отдал
          его игроку, который был на втором месте по очкам ролла или на повторный ролл.
          <u>Передавать самостоятельно предметы в указанном случае другим игрокам запрещено!</u>
          В случае нарушения у игрока изымается предмет, который он получит с рейда в дальнейшем,
          на выбор РЛа. В случае повторного нарушения игрок удаляется из рейда на определенный срок
          или из гильдии навсегда.
        </li>
      </ol>
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({

});
</script>

<style scoped>
.guild-rules {
  max-width: var(--text-page-content-max-width);
  padding: 0 40px;
}

li {
  list-style: initial;
}

li:not(:last-child) {
  margin: 0 0 10px 0;
}
</style>
